// asyncWrapper.js
/*
 Цей модуль створює функцію-обгортку, яка автоматизує обробку помилок у контролерах, 
 які повертають обіцянки (promises). Він допомагає уникнути дублювання коду
 для обробки помилок в кожному контролері.

 Вхідним параметром є контролер (функція-образ) з двома аргументами - `req` (запит) і `res` (відповідь), 
 а також третій аргумент `next` для передачі контролю наступній функції.
*/
const asyncWrapper = (controller) => {
  return (req, res, next) => controller(req, res, next).catch(next)
}

// щоб можна було використовувати в інших частинах додатку
module.exports = { asyncWrapper }
